Revit 2027 API
RebarHostData.GetRebarsInHost Method
 Returns all Rebar elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Rebar> GetRebarsInHost()
Public Function GetRebarsInHost As IList(Of Rebar)
public:
IList<Rebar^>^ GetRebarsInHost()
member GetRebarsInHost : unit -> IList<Rebar>
Return Value
IList<Rebar>
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace